Repository: mahmoud-momen/Smart-Clinic-For-Psychiatry
Catalog: lib/l10n/app_*.arb
Languages: ar

source: Settings
ar: الإعدادات

source: English
ar: الإنجليزية

source: Arabic
ar: العربية

source: Light
ar: مضيء

source: Dark
ar: داكن

source: Theme
ar: النمط

source: Language
ar: اللغة

source: Sign In
ar: تسجيل الدخول

source: Sign Up
ar: اشتراك

source: Reset Password
ar: استرجاع كلمة السر

source: Send email
ar: ارسل بريد إلكتروني

source: Restored your password
ar: استرجعت كلمة السر

source: Feel free to restore your password instantly with one button
ar: لا تتردد في استعادة كلمة المرور الخاصة بك على الفور مع زر واحد

source: Please enter your e-mail
ar: رجاءًا أدخل بريدك الإلكتروني

source: Welcome back to smart clinic for psychiatry
ar: أهلًا بكم من جديد في العيادة الذكية للطب النفسي

source: Please sign in with your e-mail
ar: يرجى تسجيل الدخول باستخدام البريد الإلكتروني الخاص_بك

source: 🎉Welcome to our vibrant community of Smart Clinic for Psychiatry
ar: مرحبًا بكم في مجتمعنا النابض بالحياة من العيادة الذكية للطب النفسي

source: Feel free to sign up and join us on our exciting journey
ar: لا تتردد في الاشتراك والانضمام إلينا في رحلتنا

source: Already have an account?
ar: هل لديك حساب؟

source: Choose Role
ar: اختر دورك

source: Good Morning
ar: صباح الخير

source: How are you feeling today?
ar: كيف تشعر اليوم؟

source: Find your patients
ar: اعثر على مرضاك

# choose_a_patient_to_help_from_our_large_patients_profiles
source: Choose a patient to help from our vast patients profiles.
ar: اختر مريضًا للمساعدة من ملفات تعريف المرضى الكبيرة لدينا

source: Heart Beat
ar: نبض القلب

source: Systolic
ar: الانقباضي

source: Diastolic
ar: الانبساطي

source: Steps
ar: الخطوات

source: Blood Oxygen
ar: الأكسجين في الدم

source: Temperature
ar: درجة حرارة

source: Articles
ar: المقالات

source: About
ar: عن البرنامج

source: Log out
ar: الخروج

source: Home
ar: الرئيسية

source: Chat
ar: الدردشة

source: Tests
ar: الاختبارات

source: Vitals
ar: الحيويه

source: Search...
ar: ابحث...

source: Full Name
ar: الأسم بالكامل

# phone_numbers
source: Phone Number
ar: رقم الهاتف

source: change password
ar: تغيير كلمة السر

source: Edit Profile
ar: تغيير الملف الشخصي

source: Save Changes
ar: حفظ التغييرات

source: Email
ar: البريد الإلكتروني

source: Current Password
ar: كلمة السر الحالية

source: New Password
ar: كلمة السر الجديدة

source: Confirm Password
ar: تأكيد كلمة المرور

source: Find your specialist
ar: جد طبيبك

# choose_a_doctor_to_help_you_from_our_large_doctors_profiles
source: Choose a doctor to help you from our vast doctors profiles.
ar: اختر طبيبًا لمساعدتك من ملفات تعريف الأطباء الكبيرة لدينا.

source: doctor
ar: طبيب

source: patient
ar: مريض

source: ok
ar: حسناً

source: Loading..
ar: جاري التحميل..

source: Logged out successfully
ar: تم تسجيل الخروج بنجاح

source: Logout Confirmation
ar: تأكيد تسجيل الخروج

source: Are you sure you want to logout?
ar: هل انت متأكد انك تريد تسجيل الخروج؟

source: cancel
ar: إلغاء

source: yes
ar: نعم

source: no
ar: لا

source: Logged In Successfully
ar: تم تسجيل الدخول بنجاح

source: Enter your email
ar: ادخل بريدك الالكتروني

source: Please enter a valid e-mail
ar: برجاء ادخال بريد الكتروني صحيح

source: Enter your password
ar: اكتب كلمة الامان الخاصه بك

source: Don't have an account?
ar: لا تملك حساب؟

source: Forgot your password?
ar: نسيت رمز الأمان؟

source: Registered Successfully
ar: تم الأشتراك بنجاح

source: password changed successfully
ar: تم تغيير كلمة المرور بنجاح

source: Please enter a valid username
ar: برجاء ادخال اسم صحيح

source: Please enter a valid phone number
ar: برجاء ادخال رقم هاتف صحيح

# phone_should_be_at_least_eleven_characters
source: Phone should be at least 11 characters
ar: رقم الهاتف يجب ان يكون مكون من احدى عشر حرف

source: Please enter a valid password
ar: برجاء ادخال كلمة مرور صحيحه

# password_should_be_at_least_six_characters
source: Password should be at least 6 characters
ar: كلمة المرور يجب ان تكون مكونه من ست احرف

source: Password verification
ar: تأكيد كلمة المرور

source: Please enter a confirmation password
ar: برجاء ادخال كلمة المرور التأكيديه بشكل صحيح

source: Please complete the missing fields!
ar: برجاء اكمال الخانات الفارغه!

source: Reset password successfully
ar: تم اعادة ضبط كلمة المرور

source: Welcome back
ar: مرحباً بعودتك

source: Password
ar: كلمة المرور

source: Password does not match!
ar: لا يوجد تطابق بين كلمات المرور!

# you_are_a
source: You're a ..
ar: انت..

source: Something went wrong
ar: حدث خطأ ما

source: We have sent you an e-mail!
ar: لقد أرسلنا لك بريدًا الكترونياً!

source: Depression
ar: الإكتئاب

source: Anxiety
ar: القلق

source: PTSD
ar: اضطراب ما بعد الصدمة

source: Schizophrenia
ar: الفُصام

source: Addiction
ar: الإدمان

source: Choose self-assessment test based on the following disorders
ar: اختر اختبار التقييم الذاتي بناءً على الاضطرابات التالية

source: Assessment Test
ar: اختبار التقييم

source: Are you having thoughts that you would be better off dead, or of hurting yourself?
ar: هل تراودك أفكار أنه من الأفضل أن تموت، أو أن تؤذي نفسك؟

source: Are you having trouble concentrating on things such as reading the newspaper or watching TV?
ar: هل تواجه صعوبة في التركيز على أشياء مثل قراءة الجريدة أو مشاهدة التلفاز؟

source: Are you feeling bad about yourself (ex. feel like a failure or constantly let your family down)?
ar: هل تشعر بالسوء تجاه نفسك (على سبيل المثال، تشعر بالفشل أو تخذل عائلتك باستمرار)؟

source: Do you have a poor appetite or are you overeating?
ar: هل تعاني من ضعف الشهية أم أنك تفرط في تناول الطعام؟

source: Are you feeling tired or having little energy?
ar: هل تشعر بالتعب أو لديك القليل من الطاقة؟

source: Are you having trouble falling or staying asleep, or sleeping too much?
ar: هل تواجه صعوبة في النوم أو الاستمرار في النوم، أو النوم كثيرًا؟

source: Are you feeling down, depressed, or hopeless?
ar: هل تشعر بالإحباط أو الاكتئاب أو اليأس؟

source: Do you have little interest or pleasure in doing things?
ar: هل لديك القليل من الاهتمام أو المتعة في القيام بالأشياء؟

source: Are you feeling nervous, anxious, or on edge?
ar: هل تشعر بالتوتر أو القلق أو على حافة الهاوية؟

source: Are you feeling unable to stop or control worrying?
ar: هل تشعر بعدم القدرة على التوقف أو السيطرة على القلق؟

source: Are you worrying too much about different things?
ar: هل تقلق كثيرًا بشأن أشياء مختلفة؟

source: Are you having trouble relaxing?
ar: هل تواجه صعوبة في الاسترخاء؟

source: Are you so restless that it is hard to sit still?
ar: هل أنت مضطرب لدرجة أنه من الصعب الجلوس ساكنًا؟

source: Are you feeling easily annoyed or irritable?
ar: هل تشعر بالانزعاج أو الانفعال بسهولة؟

source: Are you feeling as if something awful might happen?
ar: هل تشعر كما لو أن شيئًا فظيعًا قد يحدث؟

source: Are you having nightmares about a distressing event(s) or thought about the event(s) when you did not want to?
ar: هل تراودك كوابيس بشأن حدث (أحداث) مزعجة أو تفكر في الحدث (الأحداث) عندما لا ترغب في ذلك؟

source: Are you trying hard not to think about a distressing event(s) or went out of your way to avoid situations that reminded you of the event(s)?
ar: هل تحاول جاهدًا عدم التفكير في حدث (أحداث) مؤلم أو بذلت قصارى جهدك لتجنب المواقف التي تذكرك بالحدث (الأحداث)؟

source: Do you feel constantly on guard, watchful, or easily startled?
ar: هل تشعر دائمًا باليقظة أو اليقظة أو الذهول بسهولة؟

source: Do you feel numb or detached from people, activities, or your surroundings?
ar: هل تشعر بالخدر أو الانفصال عن الأشخاص أو الأنشطة أو البيئة المحيطة بك؟

source: Do you feel guilty or unable to stop blaming yourself or others for a distressing event(s) or any problems the event(s) may have caused?
ar: هل تشعر بالذنب أو عدم القدرة على التوقف عن لوم نفسك أو الآخرين بسبب حدث (أحداث) مؤلمة أو أي مشاكل قد يكون سببها هذا الحدث (الأحداث)؟

source: Are you experiencing any brain fog?
ar: هل تعاني من أي ضباب في الدماغ؟

source: Are you struggling to remember to eat or drink water?
ar: هل تجد صعوبة في تذكر تناول الطعام أو شرب الماء؟

source: Are your thoughts jumbled or are you unable to think clearly?
ar: هل أفكارك مشوشة أم أنك غير قادر على التفكير بوضوح؟

source: Are you having trouble seeing things or are you seeing things that aren't there?
ar: هل تواجه مشكلة في رؤية الأشياء أم أنك ترى أشياء غير موجودة؟

source: Do you feel extremely tired?
ar: هل تشعر بالتعب الشديد؟

source: Are the happy thoughts speeding up your thought process?
ar: هل الأفكار السعيدة تسرع عملية تفكيرك؟

source: Are the sad thoughts slowing down your thought process?
ar: هل الأفكار الحزينة تبطئ عملية تفكيرك؟

source: Are you having any grandiose thoughts?
ar: هل لديك أي أفكار عظيمة؟

source: Are you using substances to numb any physical or emotional pain?
ar: هل تستخدم مواد لتخدير أي ألم جسدي أو عاطفي؟

source: Do you feel like you should cut down on your substance use?
ar: هل تشعر أنه يجب عليك التقليل من تعاطي المخدرات؟

source: Are you feeling guilty about using substances?
ar: هل تشعر بالذنب تجاه تعاطي المخدرات؟

source: Is anyone annoying you by criticizing your substance use?
ar: هل يزعجك أحد من خلال انتقاد تعاطيك للمخدرات؟

source: Do you feel that your substance use significantly decreases your ability to function?
ar: هل تشعر أن تعاطيك للمخدرات يقلل بشكل كبير من قدرتك على العمل؟

source: Are you using substances as soon as you wake up in the morning?
ar: هل تتعاطى المواد فور استيقاظك في الصباح؟

source: Push your mental boundaries
ar: ادفع حدودك العقلية

source: Results
ar: النتائج

source: Question no
ar: السؤال رقم

source: Conclusion
ar: الإستنتاج

source: you are having chances of suffering through
ar: لديك فرص للمعاناة من

source: You have moderate chances of suffering through
ar: لديك فرص معتدلة للمعاناة من

source: You have very low chances of suffering through
ar: لديك فرص منخفضة جدًا للمعاناة من

source: High Risk
ar: مخاطرة عالية

source: Moderate Risk
ar: مجازفة معقولة الى حد ما

source: Low Risk
ar: خطر قليل

source: High
ar: عالي

source: Moderate
ar: معتدل

source: Low
ar: قليل

source: Please focus on yourself and give your self some time to meditate and relax
ar: يرجى التركيز على نفسك ومنح نفسك بعض الوقت للتأمل والاسترخاء

source: Keep meditating regularly and eat healthy. You are just few days away from perfect mental health
ar: استمر في التأمل بانتظام وتناول طعامًا صحيًا. أنت على بعد أيام قليلة من التمتع بالصحة العقلية المثالية

source: Your health seems good enough. Keep it up!!
ar: تبدو صحتك جيدة بما فيه الكفاية. واصل ذلك!!

source: Talk with your Ai
ar: تكلم مع الذكاء الاصطناعي

source: Talk with your Ai to help you with anything, anytime, anywhere.
ar: تحدث مع عقلك الاصطناعي لمساعدتك أي شيء، في أي وقت، في أي مكان.

source: Doctors List
ar: قائمة الأطباء

source: Patients List
ar: قائمة المرضى

# password_should_have_uppercase
source: Password should have at least one uppercase letter.
ar: برجاء ادخال كلمة مرور صحيحه تحتوي على حرف capital.

# password_should_have_special_character
source: Password should have at least one special character.
ar: برجاء ادخال كلمة مرور صحيحه تحتوي على رمز مشفر

source: Email not found!
ar: البريد الالكتروني غير موجود!
